tap "danielriddell21/unum"
tap "homebrew/cask-fonts"
brew "buf"
brew "colima"
brew "docker"
brew "fish"
brew "gh"
brew "go"
brew "jump"
brew "lazydocker"
brew "lazygit"
brew "mole"
brew "node"
brew "starship"
brew "uv"
brew "danielriddell21/unum/unum"
cask "bruno"
cask "claude"
cask "cleanupbuddy"
cask "freelens"
cask "iterm2"
cask "latest"
cask "linearmouse"
cask "loop"
cask "microsoft-office"
cask "microsoft-teams"
cask "monocle-app"
cask "obsidian"
cask "font-fira-code-nerd-font"
cask "visual-studio-code"
