tap "danielriddell21/tap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# CLI of the open-source IDE For exploring and testing APIs
brew "bruno-cli"
# New way of working with Protocol Buffers
brew "buf"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Helps you navigate your file system faster by learning your habits
brew "jump"
# Handy way to save and run project-specific commands
brew "just"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Deep clean and optimize your Mac
brew "mole"
# AI agent toolkit
brew "pi-coding-agent"
# Cross-shell prompt for astronauts
brew "starship"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Let there be light.
brew "danielriddell21/tap/fiatlux", trusted: true
# A small, serious-looking collection of command-line tools
brew "danielriddell21/tap/toolshed", trusted: true
# A unified developer tool suite — JSON analysis, type generation, and more
brew "danielriddell21/tap/unum", trusted: true
# Open source IDE for exploring and testing APIs
cask "bruno"
# Anthropic's official Claude AI desktop app
cask "claude"
# Clean keyboard and trackpad
cask "cleanupbuddy"
cask "font-fira-code-nerd-font"
# Kubernetes IDE
cask "freelens"
# Visualize learning algorithms in real time (native macOS window + browser demo)
cask "danielriddell21/tap/galapagos", trusted: true
# Watch two chess agents play in a native macOS window
cask "danielriddell21/tap/gambit", trusted: true
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Utility that shows the latest app updates
cask "latest"
# Customise mouse behavior
cask "linearmouse"
# Discover, download, and run local LLMs
cask "lm-studio"
# Window manager
cask "loop"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Window dimming utility
cask "monocle-app"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# A procedurally generated DOOM-style raycaster FPS
cask "danielriddell21/tap/pandemonium", trusted: true
# GUI for streamlined Redis application development
cask "redis-insight"
# A Rubik's cube solver with a native macOS 3D visualizer
cask "danielriddell21/tap/rubix", trusted: true
# Open-source code editor
cask "visual-studio-code"
vscode "asyncapi.asyncapi-preview"
vscode "bruno-api-client.bruno"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-database-client2"
vscode "davidanson.vscode-markdownlint"
vscode "drblury.protobuf-vsc"
vscode "eamodio.gitlens"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-sarifvscode.sarif-viewer"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "semanticdiff.semanticdiff"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
uv "graphifyy", with: ["openai"]
npm "@a5c-ai/babysitter-sdk"
npm "yarn"
